{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [12, 64], "name": "dense/kernel", "quantization": {"dtype": "uint8", "scale": 0.0074862330567603014, "min": -0.9133204329247567}}, {"dtype": "float32", "shape": [64], "name": "dense/bias", "quantization": {"dtype": "uint8", "scale": 0.0034714530496036304, "min": -0.4443459903492647}}, {"dtype": "float32", "shape": [64, 64], "name": "dense_1/kernel", "quantization": {"dtype": "uint8", "scale": 0.049373995089063455, "min": -10.467286958881452}}, {"dtype": "float32", "shape": [64], "name": "dense_1/bias", "quantization": {"dtype": "uint8", "scale": 0.006188717309166403, "min": -1.0149496387032901}}, {"dtype": "float32", "shape": [64, 7], "name": "dense_2/kernel", "quantization": {"dtype": "uint8", "scale": 0.017730195849549536, "min": -2.393576439689187}}, {"dtype": "float32", "shape": [7], "name": "dense_2/bias", "quantization": {"dtype": "uint8", "scale": 0.0040877342224121095, "min": -0.39651021957397464}}]}], "modelTopology": {"training_config": {"loss": "pose_estimation_loss", "loss_weights": null, "metrics": ["mae", "mse"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 6, 2], "trainable": true, "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "use_bias": true, "activity_regularizer": null}}], "name": "sequential"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "format": "layers-model"}