{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [20, 64], "name": "dense_6/kernel", "quantization": {"dtype": "uint8", "scale": 0.009218099538017721, "min": -1.290533935322481}}, {"dtype": "float32", "shape": [64], "name": "dense_6/bias", "quantization": {"dtype": "uint8", "scale": 0.004687013579349892, "min": -0.6186857924741858}}, {"dtype": "float32", "shape": [64, 64], "name": "dense_7/kernel", "quantization": {"dtype": "uint8", "scale": 0.039291670743156884, "min": -8.211959185319788}}, {"dtype": "float32", "shape": [64], "name": "dense_7/bias", "quantization": {"dtype": "uint8", "scale": 0.00595471181121527, "min": -0.9646633134168737}}, {"dtype": "float32", "shape": [64, 7], "name": "dense_8/kernel", "quantization": {"dtype": "uint8", "scale": 0.019858954934512868, "min": -3.3363044289981616}}, {"dtype": "float32", "shape": [7], "name": "dense_8/bias", "quantization": {"dtype": "uint8", "scale": 0.0023185807115891402, "min": -0.2573624589863946}}]}], "modelTopology": {"training_config": {"loss": "pose_estimation_loss", "loss_weights": null, "metrics": ["mae", "mse"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 2], "trainable": true, "name": "flatten_2", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_7", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_2"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "format": "layers-model"}