{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [20, 128], "name": "dense_114/kernel", "quantization": {"dtype": "uint8", "scale": 0.002134386230917538, "min": -0.26893266509560976}}, {"dtype": "float32", "shape": [128], "name": "dense_114/bias", "quantization": {"dtype": "uint8", "scale": 0.0010041744685640522, "min": -0.1325510298504549}}, {"dtype": "float32", "shape": [128, 64], "name": "dense_115/kernel", "quantization": {"dtype": "uint8", "scale": 0.005657657338123696, "min": -0.9957476915097705}}, {"dtype": "float32", "shape": [64], "name": "dense_115/bias", "quantization": {"dtype": "uint8", "scale": 0.00039929654083999935, "min": -0.04671769527827992}}, {"dtype": "float32", "shape": [64, 6], "name": "dense_116/kernel", "quantization": {"dtype": "uint8", "scale": 0.003852660398857266, "min": -0.5085511726491592}}, {"dtype": "float32", "shape": [6], "name": "dense_116/bias", "quantization": {"dtype": "uint8", "scale": 0.00015485298399831734, "min": 0.47012969851493835}}]}], "modelTopology": {"training_config": {"loss": "mse", "loss_weights": null, "metrics": ["mae", "mse"], "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "decay": 0.0, "centered": false, "epsilon": 1e-07, "learning_rate": 9.999999747378752e-05, "rho": 0.8999999761581421, "momentum": 0.0}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 2], "trainable": true, "name": "flatten_38", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_114", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_76", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_115", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_77", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_116", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_38"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "format": "layers-model"}